'''
1. 삼각형의 높이를 입력받은 후 삼각형을 출력하는 프로그램을 작성

[결과]
삼각형의 높이를 입력하세요 : 5
    *
   ***
  *****
 *******
*********
'''





'''
2. 년도를 입력받아 윤년인지 평년인지 출력하기.
윤년은 4로 나누어 떨어지고, 100 나누어 떨어지지 않거나, 400으로 나누어 떨어지면 윤년.
그외는 평년

년도를 입력하세요 : 2020
2020년은 윤년입니다.

년도를 입력하세요 : 2021
2021년은 평년입니다.

년도를 입력하세요 : 2100
2100년은 평년입니다.
'''




    
'''
3. 1 부터 1000 까지의 홀수의 합계 계산시 합이 최초로 1000이 넘는 숫자는 
구하는 프로그램을 작성해 보자.

1부터 20까지 홀수의 합계 계산시 처음으로 10이 넘는 숫자를 출력하기
7
1+3+5+7+9+ 11
'''





"""
4. 화씨온도= (( 9 / 5) * 섭씨온도) + 32 인 경우 
 섭씨 -20 ~ 50 도까지를 화씨 온도로 변경하여 작성하기
"""
