# -*- coding: utf-8 -*-

'''
1. 데이터 베이스의 테이블을 조회하기
select 구문을 입력하고 다음과 같은 결과가 출력되도록 프로그램을 작성하시오
[결과]
sql 입력하세요=========
select * from items

조회 레코드수: 3 ,조회 컬럼수: 3
(1, 'Apple', 800)
(2, 'Orange', 500)
(3, 'Banana', 600)
'''

'''
2. mod2.py 파일을 읽어서 mod2.bak 파일로 복사하기.
'''

'''
3. 현재폴더에 temp폴더를 생성하고, 생성된 폴더에 indata.txt 파일을
   생성하여 생성된파일에 키보드에서 입력된 정보 저장하는 프로그램 
   구현하기
'''

'''
4.원본 파일의 이름을 입력받고, 입력받은 복사본 파일이름으로 복사하는 
  프로그램 작성하기
  원본파일이 없는 경우 원본 파일이 존재하지 않습니다. 출력하기

[결과]
원본파일의 이름을 입력하세요 : aaa
원본파일이 존재하지 않습니다.

원본파일의 이름을 입력하세요 : data.txt
복사본파일의 이름을 입력하세요 : databak.txt
복사완료
'''

"""
5. 화면에서 서로다른 4자리 숫자를 입력받아 야구 게임하기
   컴퓨터가 서로다른 4자리 숫자를 임의로 기억하고,
   사용자는 숫자를 입력하여 컴퓨터가 저장한 데이터를 맞춘다.
   입력한 숫자와, 컴퓨터가 저장한 숫자가 일치하는 경우
   자리수가 맞으면 strike,
   자리수가 틀리면 ball
   strike과 ball의 갯수를 알려준다
[결과]
서로다른 4자리 숫자를 입력하세요: 1234
Strike: 0 Ball: 2

서로다른 4자리 숫자를 입력하세요: 5678
Strike: 0 Ball: 2

서로다른 4자리 숫자를 입력하세요: 8146
3 번만에 맞췄습니다.
"""

'''
6. 자연수를 입력받아 입력받은 수 N이 짝수이면 N!을,
   홀수이면 ΣN을 구하는 함수
   calc 함수를 작성하기
   4! = 4 * 3 *2 * 1
   Σ5 = 5 + 4 + 3+ 2 + 1
'''